IDENTIFICATION DIVISION.
PROGRAM-ID. SIEVE-OF-ERASTOSTHENES.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 N PIC 9(4) VALUE 1000.
    01 I PIC 9(4).
    01 J PIC 9(4).
    01 J-START PIC 9(4).
    01 L PIC 9(4).
    01 ALL-ARRAY.
    05 ALL-ITEMS PIC A OCCURS 1001 TIMES VALUE 'T'.

PROCEDURE DIVISION.

       MOVE 'F' TO ALL-ITEMS(1).
       

       PERFORM VARYING I FROM 2 BY 1 UNTIL I>N
       IF ALL-ITEMS(I) = 'T'
       COMPUTE J-START = I * I
       PERFORM VARYING J FROM J-START BY I UNTIL J>N
       MOVE 'F' TO ALL-ITEMS(J)
       END-PERFORM
       END-IF
       END-PERFORM.

       DISPLAY "THE FOLLOWING ARE THE PRIME NUMBERS UP TO 1000:\n".

       PERFORM VARYING L FROM 2 BY 1 UNTIL L>N
       IF ALL-ITEMS(L) = 'T'
       DISPLAY L
       END-IF
       END-PERFORM. 
STOP RUN.
